interface ICharToEmojiMap {
  [key: string]: string[];
}

export const charToEmojiMap: ICharToEmojiMap = {
  a: ["🅰️", "🙏", "🏔️", "🗼", "⚠️", "🖇️"],
  b: ["🅱️", "🍺", "👍"],
  c: ["🥐", "🧲", "☪️", "©️"],
  d: ["👌", "🤿"],
  e: ["📧", "🎼", "🌜"],
  f: ["🌾", "🎏"],
  g: ["🌀", "🗜️", "💽"],
  h: ["🏨", "♓", "🚧"],
  i: ["ℹ️", "🧍", "🕴️", "🌡️", "🕯️"],
  j: ["🏑", "🏒", "🎷", "🚽", "⤴️", "🌶️", "🗾"],
  k: ["🦒", "🎋", "🕺", "🏌️‍♀️"],
  l: ["🫷", "💪", "🦾", "🦶"],
  m: ["Ⓜ️", "♍", "♏", "〽️"],
  n: ["♑", "🎣", "📈"],
  o: ["🅾️", "😀", "🥺", "😶", "😑", "🍩", "🍪", "🏀", "🌏"],
  p: ["↩️", "🚩", "🅿️"],
  q: ["🍳", "🎈", "📿"],
  r: ["®️", "🌈", "💃", "🎢"],
  s: ["⚡", "💲", "🪱"],
  t: ["✝️", "🚏", "☂️", "🌴"],
  u: ["⛎", "🦭", "🦦", "👅"],
  v: ["✌️", "🖖", "♈", "✔️"],
  w: ["〰️", "♨️", "🌵", "🔱"],
  x: ["🤸‍♂️", "🤸‍♀️", "🛠️", "🔀", "✖️", "✂️"],
  y: ["⚧️", "🌱", "🦞", "🛩️"],
  z: ["🐍", "🐉", "💤"],
  "0": ["0️⃣", "🚫", "⭕"],
  "1": ["1️⃣", "🧍‍♀️", "♟️"],
  "2": ["2️⃣", "🐍", "🦢"],
  "3": ["3️⃣", "🌛"],
  "4": ["4️⃣", "🦼"],
  "5": ["5️⃣", "🍜"],
  "6": ["6️⃣", "🔓", "🔬"],
  "7": ["7️⃣", "🐬", "🦄"],
  "8": ["8️⃣", "🎱", "🥜"],
  "9": ["9️⃣", "🏓", "🎐"],
  "!": ["❗", "❕", "⚠️"],
  "#": ["#️⃣"],
  dollar: ["💲"],
  "*": ["*️⃣", "✳️", "✴️", "🔯"],
  "-": ["➖", "⛔"],
  "=": ["🟰"],
  "+": ["➕"],
  "/": ["🖊️", "🖌️", "🪈"],
  "\\": ["🪛", "📏"],
  ".": ["🔸", "🔹"],
  "?": ["❓", "❔"],
};

export const convertToEmojis = (text: string, seed: number | number[]) => {
  let emojis = "";
  for (let i = 0; i < text.length; i++) {
    const char = text[i];
    const key = char === "$" ? "dollar" : char.toLowerCase();
    const indexSeed = Array.isArray(seed) ? seed[i % seed.length] : seed;
    const index = Math.floor(indexSeed * charToEmojiMap[key]?.length);
    emojis += charToEmojiMap[key]?.[index] ?? char;
  }

  return emojis;
};
